app/controllers/reviews_controller.rb

def index
	    if current_user == nil
	    	Review.delete_all
	    end
  		# if session[:isbn].class == NilClass
  		# 	redirect_to "/welcome"
  		# # 	# @new_session = true
  		# else
	  		@review = Review.new
	  		@goodreads_id = session[:isbn].to_s
	  		puts "SESSION ISBN #{@goodreads_id}"
	  		@reviews = Review.where("(isbn LIKE '#{@goodreads_id}') AND (review_text LIKE :query OR title LIKE :query)",
	  		query: "%#{params[:search_reviews]}%")
	  		# respond_to do |format|
			  #   format.html
			  #   format.csv do
			  #     headers['Content-Disposition'] = "attachment; filename=\"#{@title}reviews-list.csv\""
			  #     headers['Content-Type'] ||= 'text/csv'
			  #   end
			  # end
		  	@img = session[:img]
	  		@title = session[:title]
	  		@author = session[:author]
	  		# @date = session[:date]
	  		@gr_reviews_count = session[:gr_reviews_count]
	  		#count number of titles pulled this month, using recent titles timestamps
	  		@monthly_titles_pulled = 0
	  		@this_month = Date.today.strftime("%B")
	  		#GET RECENT TITLES FOR ALL USERS
	  		@all_users = User.all
---
SELECT "reviews".* FROM "reviews" WHERE ((isbn LIKE '28016509') AND (review_text LIKE '%%' OR title LIKE '%%'))
SELECT "users".* FROM "users"

  	def callReviews
  			#clearing database
			if params[:clearisbn].to_i == 1
				puts "clearing now"
				Review.where(:isbn=>session[:isbn]).delete_all
---
DELETE FROM "reviews" WHERE "reviews"."isbn" = ?  [["isbn", "28016509"]]

					if @amz_review_array[0] != 1
						@@amz_check = true
					end
				@reviews_array = @gr_review_array.push(*@amz_review_array)
---
INSERT INTO "reviews" ("isbn", "title", "author", "date", "review_text", "platform", "star_rating", "img", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

				end
				#if the newly pulled title was pulled already this month, don't add
				if @title_pulled_this_month == true
					current_user.save
---
UPDATE "users" SET "recent_titles" = ?, "updated_at" = ? WHERE "users"."id" = ?